microbuilder/IntroToBLE/nRF51822/lib/sdk/nRF51_SDK_v5.1.0.36092/Nordic/nrf51822/Board/nrf6310/s110/ble_app_hids_keyboard/main.c
    offset = pattern_offset;
    data_len = pattern_len;

    do
    {
        memset (data,0,INPUT_REPORT_KEYS_MAX_LEN);
        memcpy (data + 2 +offset,p_key_pattern+offset,data_len - offset);
        retval = ble_hids_inp_rep_send (p_instance,INPUT_REPORT_KEYS_INDEX,INPUT_REPORT_KEYS_MAX_LEN,data);
        if (NRF_SUCCESS != retval)
        {
            break;
        }
        offset++;
    } while (offset <= data_len);

    (*actual_len) = offset;

    return retval;
}

/**@brief Initializes the buffer queue used to key events that could not be transmitted
 *
 * @warning This handler is an example only. You need to analyze how you wish to buffer or buffer at all.
 *
 * @note    In case pf HID keyboard, a temporary buffering could be employed to handle scenarios where
 *          encryption is not yet enabled or therewas a momentary link loss or there were no Transmit buffers.
 */
void buffer_init (void)
{
    uint32_t buffer_count;

    BUFFER_LIST_INIT();

    for (buffer_count = 0; buffer_count < MAX_BUFFER_ENTRIES; buffer_count++)
    {
        BUFFER_INIT_ELEMENT (buffer_count);
    }
}

/**@brief Function to enqueue key scan patterns that could not be tranmisted either completely of partically.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key release.
 *
 * @param[in]  p_hids         Identifies the service for which Key Notifications are buffered.
 * @param[in]  p_key_pattern  Pointer to key pattern.
 * @param[in]  pattern_len    Length of key pattern.
 * @param[in]  offset         Offset applied to Key Pattern when requesting a transmission on dequeue, @ref buffer_dequeue.
 * @return     NRF_SUCCESS on sucess, else an error code indicating reason for failure.
 */
uint32_t buffer_enqueue
         (
             /* IN */ ble_hids_t             * p_hids,
             /* IN */ uint8_t                * p_key_pattern,
             /* IN */ uint16_t               pattern_len,
             /* IN */ uint16_t               offset
         )
{
    buffer_entry_t * element;
    uint32_t retval;

    retval = NRF_SUCCESS;

    if (true == BUFFER_LIST_FULL())
    {
        /* Element cannot be buffered */
        retval = NRF_ERROR_NO_MEM;
    }
    else
    {
        /* Make entry of buffer element and copy data */
        element =  &buffer_list.buffer[(buffer_list.wp)];
        element->p_instance = p_hids;
        element->p_data = p_key_pattern;
        element->data_offset = offset;
        element->data_len = pattern_len;
        buffer_list.count++;
        buffer_list.wp++;
        if (MAX_BUFFER_ENTRIES == buffer_list.wp)
        {
            buffer_list.wp = 0;
        }
    }

    return retval;
}

/**@brief Function to dequeue key scan patterns that could not be tranmisted either completely of partically.
 *
 * @warning This handler is an example only. You need to analyze how you wish to send the key release.
 *
 * @param[in]  tx_flag   Indicative of whether the dequeue should result in transmission or not.
 * @note       A typical example when all keys are dequeued with tranmission is when link is disconnected.
 *
 * @return     NRF_SUCCESS on sucess, else an error code indicating reason for failure.
 */
uint32_t buffer_dequeue(bool tx_flag)
{
    buffer_entry_t * element;
    uint32_t retval;
    uint16_t actual_len;

    retval = NRF_SUCCESS;

    if (true == BUFFER_LIST_EMPTY())
    {
        retval = NRF_ERROR_NOT_FOUND;
    }
    else
    {
        bool remove_element;

        remove_element = true;
        element = &buffer_list.buffer[(buffer_list.rp)];
        if (tx_flag)
        {
           retval = send_key_scan_press_release
                    (
                        element->p_instance,
                        element->p_data,
                        element->data_len,
                        element->data_offset,
                        &actual_len
                    );
           // An additional notification is needed for release of all keys, therefore check
           // is for actual_len <= element->data_len and not actual_len < element->data_len
           if ((BLE_ERROR_NO_TX_BUFFERS == retval) && (actual_len <= element->data_len))
           {
               // Transmission could not be completed, do not remove the entry, adjust next data to be transmitted
               element->data_offset = actual_len;
               remove_element = false;
           }
        }

        if(true == remove_element)
        {
            BUFFER_INIT_ELEMENT (buffer_list.rp);
            buffer_list.rp++;
            buffer_list.count--;
            if (MAX_BUFFER_ENTRIES == buffer_list.rp)
            {
                buffer_list.rp = 0;
            }
        }
    }

    return retval;
}


/**@brief Function for sending sample key presses to the peer.
 *
 * @param[in]   key_pattern_len   Pattern length.
 * @param[in]   p_key_pattern     Pattern to be sent.
 */
static void keys_send(uint8_t key_pattern_len, uint8_t * p_key_pattern)
{
    uint32_t err_code;
    uint16_t actual_len;

    if (m_in_boot_mode)
    {
        err_code = ble_hids_boot_kb_inp_rep_send(&m_hids,
                                                 key_pattern_len,
                                                 p_key_pattern);
        if (err_code == NRF_SUCCESS)
        {
            err_code = ble_hids_boot_kb_inp_rep_send(&m_hids,
                                                     key_pattern_len,
                                                     (uint8_t *) m_sample_key_release_pattern);
        }
    }
    else
    {
        err_code = send_key_scan_press_release(&m_hids,
                                               p_key_pattern,
                                         key_pattern_len,
                                               0,
                                               &actual_len);
        // An additional notification is needed for release of all keys, therefore check
        // is for actual_len <= key_pattern_len and not actual_len < key_pattern_len.
        if ((BLE_ERROR_NO_TX_BUFFERS == err_code) && (actual_len <= key_pattern_len))
        {
            // Buffer enqueue routine return value is not intentionally checked.
            // Rationale: Its better to have a a few keys missing than have a system
            // reset. Recommendation is to work out most optimal valur for
            // MAX_BUFFER_ENTRIES to minimize chances of buffer queue full condition
            (void)buffer_enqueue (&m_hids,p_key_pattern,key_pattern_len,actual_len);
        }
    }

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


/**@brief Function for handling the HID Report Characteristic Write event.
 *
 * @param[in]   p_evt   HID service event.
 */
static void on_hid_rep_char_write(ble_hids_evt_t *p_evt)
{
    if (p_evt->params.char_write.char_id.rep_type == BLE_HIDS_REP_TYPE_OUTPUT)
    {
        uint32_t err_code;
        uint8_t  report_val;
        uint8_t  report_index = p_evt->params.char_write.char_id.rep_index;

        if (report_index == OUTPUT_REPORT_INDEX)
        {
            APP_ERROR_CHECK_BOOL(OUTPUT_REPORT_MAX_LEN == 1);

            err_code = ble_hids_outp_rep_get(&m_hids,
                                             report_index,
                                             OUTPUT_REPORT_MAX_LEN,
                                             0,
                                             &report_val);
            APP_ERROR_CHECK(err_code);

            if ((report_val & OUTPUT_REPORT_BIT_MASK_CAPS_LOCK) != 0)
            {
                // Caps Lock On.
                nrf_gpio_pin_set(CAPS_ON_LED_PIN_NO);
                keys_send(sizeof(m_caps_on_key_scan_str), m_caps_on_key_scan_str);
            }
            else
            {
                // Caps Lock Off.
                nrf_gpio_pin_clear(CAPS_ON_LED_PIN_NO);
                keys_send(sizeof(m_caps_off_key_scan_str), m_caps_off_key_scan_str);
            }
        }
    }
}


